Repository: maodongya/ai-book
Catalog: Sources/AIBook/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: de, el, en, fr, it, ja, la

# vm.panel.saveExplanationMsg
source: 将讲解对话保存为 UTF-8 文本
de: Save explanation chat as UTF-8
el: Save explanation chat as UTF-8
en: Save explanation chat as UTF-8
fr: Save explanation chat as UTF-8
it: Save explanation chat as UTF-8
ja: Save explanation chat as UTF-8
la: Save explanation chat as UTF-8

# vm.saved.explanation
source: 已保存讲解
de: Explanation saved
el: Explanation saved
en: Explanation saved
fr: Explanation saved
it: Explanation saved
ja: Explanation saved
la: Explanation saved

# vm.panel.openExplanation
source: 打开讲解内容
de: Open explanation
el: Open explanation
en: Open explanation
fr: Open explanation
it: Open explanation
ja: Open explanation
la: Open explanation

# vm.error.explanationOpenEmpty
source: 打开的讲解文本为空。
de: Opened explanation is empty.
el: Opened explanation is empty.
en: Opened explanation is empty.
fr: Opened explanation is empty.
it: Opened explanation is empty.
ja: Opened explanation is empty.
la: Opened explanation is empty.

# vm.opened.explanation
source: 已打开讲解 %@
de: Opened explanation %@
el: Opened explanation %@
en: Opened explanation %@
fr: Opened explanation %@
it: Opened explanation %@
ja: Opened explanation %@
la: Opened explanation %@

# vm.error.openExplanation
source: 无法打开讲解内容：%@
de: Could not open explanation: %@
el: Could not open explanation: %@
en: Could not open explanation: %@
fr: Could not open explanation: %@
it: Could not open explanation: %@
ja: Could not open explanation: %@
la: Could not open explanation: %@

# vm.error.noExplanationSelection
source: 当前没有可选中的讲解内容。
de: No explanation selection.
el: No explanation selection.
en: No explanation selection.
fr: No explanation selection.
it: No explanation selection.
ja: No explanation selection.
la: No explanation selection.

# vm.error.noSourceToSpeak
source: 当前没有可朗读的原文内容，请先输入或打开文本。
de: No source text to read.
el: No source text to read.
en: No source text to read.
fr: No source text to read.
it: No source text to read.
ja: No source text to read.
la: No source text to read.

# vm.error.selectSourceToSpeak
source: 请先在左页选中要朗读的文字。
de: Select source text to read.
el: Select source text to read.
en: Select source text to read.
fr: Select source text to read.
it: Select source text to read.
ja: Select source text to read.
la: Select source text to read.

# vm.error.translationEmptySpeak
source: 当前翻译为空，请先生成或打开翻译内容。
de: Translation empty.
el: Translation empty.
en: Translation empty.
fr: Translation empty.
it: Translation empty.
ja: Translation empty.
la: Translation empty.

# vm.error.selectTranslationToSpeak
source: 请先在翻译区选中要朗读的文字。
de: Select translation text to read.
el: Select translation text to read.
en: Select translation text to read.
fr: Select translation text to read.
it: Select translation text to read.
ja: Select translation text to read.
la: Select translation text to read.

# vm.error.noExplanationToSpeak
source: 当前没有可朗读的讲解内容。
de: No explanation to read.
el: No explanation to read.
en: No explanation to read.
fr: No explanation to read.
it: No explanation to read.
ja: No explanation to read.
la: No explanation to read.

# vm.error.selectExplanationToSpeak
source: 请先在讲解区选中要朗读的文字（可先点全选）。
de: Select explanation text to read.
el: Select explanation text to read.
en: Select explanation text to read.
fr: Select explanation text to read.
it: Select explanation text to read.
ja: Select explanation text to read.
la: Select explanation text to read.

# vm.imported.explanationDraft
source: 已导入讲解文稿
de: Explanation draft imported
el: Explanation draft imported
en: Explanation draft imported
fr: Explanation draft imported
it: Explanation draft imported
ja: Explanation draft imported
la: Explanation draft imported

# vm.error.sourceProjectMissing
source: 未找到 ai-book 源码目录（需含 Package.swift 与 Sources/AIBook）。请确认 %@ 存在。
de: ai-book source not found at %@
el: ai-book source not found at %@
en: ai-book source not found at %@
fr: ai-book source not found at %@
it: ai-book source not found at %@
ja: ai-book source not found at %@
la: ai-book source not found at %@

# vm.error.sourceProjectMissingShort
source: 未找到 ai-book 源码目录（需含 Package.swift 与 Sources/AIBook）。
de: ai-book source directory not found.
el: ai-book source directory not found.
en: ai-book source directory not found.
fr: ai-book source directory not found.
it: ai-book source directory not found.
ja: ai-book source directory not found.
la: ai-book source directory not found.

# vm.display.evolutionItem
source: 自我进化 · 第 %lld 条
de: Self evolution · item %lld
el: Self evolution · item %lld
en: Self evolution · item %lld
fr: Self evolution · item %lld
it: Self evolution · item %lld
ja: Self evolution · item %lld
la: Self evolution · item %lld

# vm.display.analyze
source: 分析优化
de: Analyze
el: Analyze
en: Analyze
fr: Analyze
it: Analyze
ja: Analyze
la: Analyze

# vm.display.analyzeWith
source: 分析优化：%@
de: Analyze: %@
el: Analyze: %@
en: Analyze: %@
fr: Analyze: %@
it: Analyze: %@
ja: Analyze: %@
la: Analyze: %@

# vm.error.selectParagraph
source: 请先在左页选中一段文字。
de: Select a paragraph on the left page.
el: Select a paragraph on the left page.
en: Select a paragraph on the left page.
fr: Select a paragraph on the left page.
it: Select a paragraph on the left page.
ja: Select a paragraph on the left page.
la: Select a paragraph on the left page.

# vm.display.explainSelection
source: 选择讲解（%lld 字）
de: Explain selection (%lld chars)
el: Explain selection (%lld chars)
en: Explain selection (%lld chars)
fr: Explain selection (%lld chars)
it: Explain selection (%lld chars)
ja: Explain selection (%lld chars)
la: Explain selection (%lld chars)

# vm.error.openArticleFirst
source: 请先在左页输入或打开文章内容。
de: Open or enter source text first.
el: Open or enter source text first.
en: Open or enter source text first.
fr: Open or enter source text first.
it: Open or enter source text first.
ja: Open or enter source text first.
la: Open or enter source text first.

# vm.display.explainFull
source: 全文讲解（%lld 字）
de: Explain all (%lld chars)
el: Explain all (%lld chars)
en: Explain all (%lld chars)
fr: Explain all (%lld chars)
it: Explain all (%lld chars)
ja: Explain all (%lld chars)
la: Explain all (%lld chars)

# vm.error.noReadableContent
source: 当前没有可朗读内容，请先输入或打开文本。
de: No readable content.
el: No readable content.
en: No readable content.
fr: No readable content.
it: No readable content.
ja: No readable content.
la: No readable content.

# vm.error.classicsPasteFirst
source: 请先在左页粘贴或打开名著节选文本。
de: Paste or open classic excerpt first.
el: Paste or open classic excerpt first.
en: Paste or open classic excerpt first.
fr: Paste or open classic excerpt first.
it: Paste or open classic excerpt first.
ja: Paste or open classic excerpt first.
la: Paste or open classic excerpt first.

# vm.error.classicsNeedLLM
source: 名著补充需配置读书大模型，请在 book 设置中选择本地模型。
de: Configure book LLM for classics supplement.
el: Configure book LLM for classics supplement.
en: Configure book LLM for classics supplement.
fr: Configure book LLM for classics supplement.
it: Configure book LLM for classics supplement.
ja: Configure book LLM for classics supplement.
la: Configure book LLM for classics supplement.

# vm.classics.done
source: 名著补充完成，已写入左页（%lld 字）并保存。
de: Classic supplement done (%lld chars).
el: Classic supplement done (%lld chars).
en: Classic supplement done (%lld chars).
fr: Classic supplement done (%lld chars).
it: Classic supplement done (%lld chars).
ja: Classic supplement done (%lld chars).
la: Classic supplement done (%lld chars).

# vm.classics.failed
source: 名著补充失败：%@
de: Classic supplement failed: %@
el: Classic supplement failed: %@
en: Classic supplement failed: %@
fr: Classic supplement failed: %@
it: Classic supplement failed: %@
ja: Classic supplement failed: %@
la: Classic supplement failed: %@

# vm.error.translationSourceFirst
source: 请先在左页输入、打开或选中要翻译的文章内容。
de: Select source text to translate.
el: Select source text to translate.
en: Select source text to translate.
fr: Select source text to translate.
it: Select source text to translate.
ja: Select source text to translate.
la: Select source text to translate.

# vm.display.wordTranslation
source: 生成逐字翻译
de: Word translation
el: Word translation
en: Word translation
fr: Word translation
it: Word translation
ja: Word translation
la: Word translation

# vm.display.paragraphTranslation
source: 生成整段翻译
de: Paragraph translation
el: Paragraph translation
en: Paragraph translation
fr: Paragraph translation
it: Paragraph translation
ja: Paragraph translation
la: Paragraph translation

# vm.error.translationEmptySave
source: 当前翻译为空，无法保存。
de: Translation empty.
el: Translation empty.
en: Translation empty.
fr: Translation empty.
it: Translation empty.
ja: Translation empty.
la: Translation empty.

# vm.panel.saveTranslation
source: 保存翻译内容
de: Save translation
el: Save translation
en: Save translation
fr: Save translation
it: Save translation
ja: Save translation
la: Save translation

# vm.panel.saveTranslationMsg
source: 将右侧翻译内容保存为 UTF-8 文本
de: Save translation as UTF-8
el: Save translation as UTF-8
en: Save translation as UTF-8
fr: Save translation as UTF-8
it: Save translation as UTF-8
ja: Save translation as UTF-8
la: Save translation as UTF-8

# vm.saved.translation
source: 已保存翻译
de: Translation saved
el: Translation saved
en: Translation saved
fr: Translation saved
it: Translation saved
ja: Translation saved
la: Translation saved

# vm.panel.openTranslation
source: 打开翻译内容
de: Open translation
el: Open translation
en: Open translation
fr: Open translation
it: Open translation
ja: Open translation
la: Open translation

# vm.opened.translation
source: 已打开翻译 %@
de: Opened translation %@
el: Opened translation %@
en: Opened translation %@
fr: Opened translation %@
it: Opened translation %@
ja: Opened translation %@
la: Opened translation %@

# vm.error.openTranslation
source: 无法打开翻译内容：%@
de: Could not open translation: %@
el: Could not open translation: %@
en: Could not open translation: %@
fr: Could not open translation: %@
it: Could not open translation: %@
ja: Could not open translation: %@
la: Could not open translation: %@

# vm.evolution.commandDoneUpgrade
source: 第 %lld 条进化已完成。正在自动升级并继续下一条…
de: Item %lld done. Auto upgrade and continue…
el: Item %lld done. Auto upgrade and continue…
en: Item %lld done. Auto upgrade and continue…
fr: Item %lld done. Auto upgrade and continue…
it: Item %lld done. Auto upgrade and continue…
ja: Item %lld done. Auto upgrade and continue…
la: Item %lld done. Auto upgrade and continue…

# vm.evolution.allDoneUpgrade
source: 全部优化项已完成。正在自动升级并重启 AIBook…
de: All done. Auto upgrade and restart…
el: All done. Auto upgrade and restart…
en: All done. Auto upgrade and restart…
fr: All done. Auto upgrade and restart…
it: All done. Auto upgrade and restart…
ja: All done. Auto upgrade and restart…
la: All done. Auto upgrade and restart…

# vm.error.parseFailed
source: 解析失败：%@
de: Parse failed: %@
el: Parse failed: %@
en: Parse failed: %@
fr: Parse failed: %@
it: Parse failed: %@
ja: Parse failed: %@
la: Parse failed: %@

# vm.error.alignLocked
source: 对照关系已锁定。请先解锁后再整体对齐。
de: Alignment locked. Unlock first.
el: Alignment locked. Unlock first.
en: Alignment locked. Unlock first.
fr: Alignment locked. Unlock first.
it: Alignment locked. Unlock first.
ja: Alignment locked. Unlock first.
la: Alignment locked. Unlock first.

# vm.error.alignNeedBoth
source: 请先在左页打开或输入原文，并在右页加载或输入译文。
de: Need source and translation.
el: Need source and translation.
en: Need source and translation.
fr: Need source and translation.
it: Need source and translation.
ja: Need source and translation.
la: Need source and translation.

# vm.error.alignBuildFailed
source: 无法从当前译文建立对齐。请确认译文为整段/逐字格式，或与原文段落数相近。
de: Could not build alignment.
el: Could not build alignment.
en: Could not build alignment.
fr: Could not build alignment.
it: Could not build alignment.
ja: Could not build alignment.
la: Could not build alignment.

# vm.align.resegmentedSuffix
source: ，译文已按原文段落重新分割
de: , re-segmented by source paragraphs
el: , re-segmented by source paragraphs
en: , re-segmented by source paragraphs
fr: , re-segmented by source paragraphs
it: , re-segmented by source paragraphs
ja: , re-segmented by source paragraphs
la: , re-segmented by source paragraphs

# vm.align.done
source: 已对齐 %lld/%lld 段%@
de: Aligned %lld/%lld blocks%@
el: Aligned %lld/%lld blocks%@
en: Aligned %lld/%lld blocks%@
fr: Aligned %lld/%lld blocks%@
it: Aligned %lld/%lld blocks%@
ja: Aligned %lld/%lld blocks%@
la: Aligned %lld/%lld blocks%@

# vm.align.savedLocked
source: 对照关系已锁定并保存
de: Alignment locked and saved
el: Alignment locked and saved
en: Alignment locked and saved
fr: Alignment locked and saved
it: Alignment locked and saved
ja: Alignment locked and saved
la: Alignment locked and saved

# vm.align.unlocked
source: 已解锁，可继续整体调整
de: Unlocked; you can realign
el: Unlocked; you can realign
en: Unlocked; you can realign
fr: Unlocked; you can realign
it: Unlocked; you can realign
ja: Unlocked; you can realign
la: Unlocked; you can realign

# vm.align.cannotMergeDown
source: 已是最后一行，无法向下合并
de: Last row; cannot merge down
el: Last row; cannot merge down
en: Last row; cannot merge down
fr: Last row; cannot merge down
it: Last row; cannot merge down
ja: Last row; cannot merge down
la: Last row; cannot merge down

# vm.rebuild.running
source: 正在执行 scripts/build-and-install.sh …
de: Running build-and-install…
el: Running build-and-install…
en: Running build-and-install…
fr: Running build-and-install…
it: Running build-and-install…
ja: Running build-and-install…
la: Running build-and-install…

# vm.rebuild.failedDefault
source: 自动升级构建失败，请查看构建脚本输出。
de: Auto upgrade build failed.
el: Auto upgrade build failed.
en: Auto upgrade build failed.
fr: Auto upgrade build failed.
it: Auto upgrade build failed.
ja: Auto upgrade build failed.
la: Auto upgrade build failed.

# vm.rebuild.failedStop
source: 自动升级构建失败，已停止重启链路：%@
de: Auto upgrade failed: %@
el: Auto upgrade failed: %@
en: Auto upgrade failed: %@
fr: Auto upgrade failed: %@
it: Auto upgrade failed: %@
ja: Auto upgrade failed: %@
la: Auto upgrade failed: %@

# vm.error.restoreChat
source: 无法恢复上次对话：%@
de: Could not restore chat: %@
el: Could not restore chat: %@
en: Could not restore chat: %@
fr: Could not restore chat: %@
it: Could not restore chat: %@
ja: Could not restore chat: %@
la: Could not restore chat: %@

# vm.error.saveChat
source: 无法保存对话会话：%@
de: Could not save chat: %@
el: Could not save chat: %@
en: Could not save chat: %@
fr: Could not save chat: %@
it: Could not save chat: %@
ja: Could not save chat: %@
la: Could not save chat: %@

# vm.evolution.itemExecuted
source: 第 %lld 条自我进化已执行。
de: Evolution item %lld executed.
el: Evolution item %lld executed.
en: Evolution item %lld executed.
fr: Evolution item %lld executed.
it: Evolution item %lld executed.
ja: Evolution item %lld executed.
la: Evolution item %lld executed.

# vm.evolution.analysisDirty
source: 分析过程修改了源码，已放弃入队。请用 git 恢复后重试。
de: Analysis modified source; reverted. Use git restore.
el: Analysis modified source; reverted. Use git restore.
en: Analysis modified source; reverted. Use git restore.
fr: Analysis modified source; reverted. Use git restore.
it: Analysis modified source; reverted. Use git restore.
ja: Analysis modified source; reverted. Use git restore.
la: Analysis modified source; reverted. Use git restore.

# vm.evolution.noNewItems
source: 未发现新的优化项。
de: No new optimizations found.
el: No new optimizations found.
en: No new optimizations found.
fr: No new optimizations found.
it: No new optimizations found.
ja: No new optimizations found.
la: No new optimizations found.

# vm.error.speechEmpty
source: 无法朗读：当前文本处理后没有可合成的内容。
de: Nothing to speak after processing.
el: Nothing to speak after processing.
en: Nothing to speak after processing.
fr: Nothing to speak after processing.
it: Nothing to speak after processing.
ja: Nothing to speak after processing.
la: Nothing to speak after processing.

# vm.action.evolve
source: 执行进化
de: Run evolution
el: Run evolution
en: Run evolution
fr: Run evolution
it: Run evolution
ja: Run evolution
la: Run evolution

# vm.action.analyze
source: 分析优化
de: Analyze
el: Analyze
en: Analyze
fr: Analyze
it: Analyze
ja: Analyze
la: Analyze

# vm.action.followUp
source: 发送追问
de: Follow-up
el: Follow-up
en: Follow-up
fr: Follow-up
it: Follow-up
ja: Follow-up
la: Follow-up

# vm.action.autoEvolve
source: 自动进化
de: Auto evolution
el: Auto evolution
en: Auto evolution
fr: Auto evolution
it: Auto evolution
ja: Auto evolution
la: Auto evolution

# vm.chat.welcomeAssistant
source: 右页是你的读书助手
de: The right page is your reading assistant
el: The right page is your reading assistant
en: The right page is your reading assistant
fr: The right page is your reading assistant
it: The right page is your reading assistant
ja: The right page is your reading assistant
la: The right page is your reading assistant

# vm.chat.welcomeEvolution
source: 这是 AI 进化选项卡
de: This is the AI evolution tab
el: This is the AI evolution tab
en: This is the AI evolution tab
fr: This is the AI evolution tab
it: This is the AI evolution tab
ja: This is the AI evolution tab
la: This is the AI evolution tab

# vm.chat.legacyReadingHint
source: 右页支持两种解析方式
de: The right page supports two parsing modes
el: The right page supports two parsing modes
en: The right page supports two parsing modes
fr: The right page supports two parsing modes
it: The right page supports two parsing modes
ja: The right page supports two parsing modes
la: The right page supports two parsing modes

# vm.filename.explanationSuffix
source: -讲解.txt
de: -explanation.txt
el: -explanation.txt
en: -explanation.txt
fr: -explanation.txt
it: -explanation.txt
ja: -explanation.txt
la: -explanation.txt

# vm.filename.translationSuffix
source: -翻译.txt
de: -translation.txt
el: -translation.txt
en: -translation.txt
fr: -translation.txt
it: -translation.txt
ja: -translation.txt
la: -translation.txt

# help.toolbarOverflowDefault
source: 更多顶栏操作
de: More toolbar actions
el: More toolbar actions
en: More toolbar actions
fr: More toolbar actions
it: More toolbar actions
ja: More toolbar actions
la: More toolbar actions

# font.followTheme
source: 跟随主题
de: Follow theme
el: Follow theme
en: Follow theme
fr: Follow theme
it: Follow theme
ja: Follow theme
la: Follow theme

# font.songti
source: 宋体
de: Songti
el: Songti
en: Songti
fr: Songti
it: Songti
ja: Songti
la: Songti

# font.kaiti
source: 楷体
de: Kaiti
el: Kaiti
en: Kaiti
fr: Kaiti
it: Kaiti
ja: Kaiti
la: Kaiti

# font.heiti
source: 黑体
de: Heiti
el: Heiti
en: Heiti
fr: Heiti
it: Heiti
ja: Heiti
la: Heiti

# font.pingfang
source: 苹方
de: PingFang
el: PingFang
en: PingFang
fr: PingFang
it: PingFang
ja: PingFang
la: PingFang

# font.systemDefault
source: 系统默认
de: System default
el: System default
en: System default
fr: System default
it: System default
ja: System default
la: System default

# menuSummary.document
source: %@ 新建 · %@ 打开 · %@ 保存 · %@ 另存为 · %@ 全选 · %@ 名著补充
de: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
el: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
en: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
fr: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
it: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
ja: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement
la: %@ New · %@ Open · %@ Save · %@ Save As · %@ Select All · %@ Classic supplement

# menuSummary.explanation
source: %@ 选择讲解 · %@ 全文讲解
de: %@ Explain selection · %@ Explain all
el: %@ Explain selection · %@ Explain all
en: %@ Explain selection · %@ Explain all
fr: %@ Explain selection · %@ Explain all
it: %@ Explain selection · %@ Explain all
ja: %@ Explain selection · %@ Explain all
la: %@ Explain selection · %@ Explain all

# menuSummary.translation
source: %@ 朗读翻译 · %@ 全选翻译
de: %@ Read translation · %@ Select all translation
el: %@ Read translation · %@ Select all translation
en: %@ Read translation · %@ Select all translation
fr: %@ Read translation · %@ Select all translation
it: %@ Read translation · %@ Select all translation
ja: %@ Read translation · %@ Select all translation
la: %@ Read translation · %@ Select all translation

# menuSummary.speech
source: %@ 朗读原文（选中/全文） · %@ 朗读翻译全文
de: %@ Read source · %@ Read translation
el: %@ Read source · %@ Read translation
en: %@ Read source · %@ Read translation
fr: %@ Read source · %@ Read translation
it: %@ Read source · %@ Read translation
ja: %@ Read source · %@ Read translation
la: %@ Read source · %@ Read translation

# menuSummary.evolution
source: %@ 进化
de: %@ Evolve
el: %@ Evolve
en: %@ Evolve
fr: %@ Evolve
it: %@ Evolve
ja: %@ Evolve
la: %@ Evolve

# welcome.evolution
source: 这是 AI 进化选项卡，自我进化流程： · ① 分析优化：Cursor 只读探索源码，将改进点写入优化队列 · ② 进化改码：取下一条待办，Agent 改码并自动构建重启 · 左页编号命令（N、…）与优化队列双向同步；完成项自动标记「已完成」 · 顶栏「进化操作」菜单：保存/打开进化命令到本地 .txt · 顶栏：Cursor 模型、自动升级与优化队列 · 输入框可写分析方向；底栏「分析优化」只读探索并入队（不改码） · 「进化」或 ⌘E：取下一条待办并改码、构建重启；「发送」用于进化追问 · 执行时流式展示 Agent 执行过程与最终回复 · 「自动升级」开启后改码完成将打包重启并继续下一条 · 输入栏下方显示 Token 已用/剩余；超限将阻止进化与追问 Cursor Key 与桥接请在顶栏「进化设置」中配置。
de: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
el: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
en: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
fr: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
it: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
ja: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.
la: AI Evolution tab — analyze source, enqueue improvements, run Cursor Agent to modify code, build and restart. Configure Cursor in Evolution settings.

# classic.capabilityLabel
source: 名著补充
de: Classic supplement
el: Classic supplement
en: Classic supplement
fr: Classic supplement
it: Classic supplement
ja: Classic supplement
la: Classic supplement

# evolution.capabilityLabel
source: 自我进化
de: Self evolution
el: Self evolution
en: Self evolution
fr: Self evolution
it: Self evolution
ja: Self evolution
la: Self evolution
